sshahryiar/STM32-Projects/Seeedstudio_UF0_Touch_Lights/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
uint16_t ms;
uint8_t sign_change;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CAP_K1_KEY_Pin GPIO_PIN_0
#define CAP_K1_KEY_GPIO_Port GPIOB
#define CAP_K2__KEY_Pin GPIO_PIN_1
#define CAP_K2__KEY_GPIO_Port GPIOB
#define CAP_G3_SMPL_Pin GPIO_PIN_2
#define CAP_G3_SMPL_GPIO_Port GPIOB
#define R_LED_Pin GPIO_PIN_13
#define R_LED_GPIO_Port GPIOB
#define Y_LED_Pin GPIO_PIN_14
#define Y_LED_GPIO_Port GPIOB
#define G_LED_Pin GPIO_PIN_15
#define G_LED_GPIO_Port GPIOB
#define CAP_K3_KEY_Pin GPIO_PIN_11
#define CAP_K3_KEY_GPIO_Port GPIOA
#define CAP_G4_SMPL_Pin GPIO_PIN_12
#define CAP_G4_SMPL_GPIO_Port GPIOA
#define ONBOARD_LED_Pin GPIO_PIN_15
#define ONBOARD_LED_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
